508284405/stackchan-lifeos/firmware/idf/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# Measured on ESP32-S3 rev 0.2 hardware: the gateway ingest path keeps
# bounded 8 KiB payload buffers live across parse/ack temporaries, peaking at
# ~44 KiB of main-task stack; 64 KiB leaves headroom for ISR frames.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# The on-board XMC 0x46/0x4018 flash intermittently misreads the partition
# table at 80 MHz after a USB reset; keep PSRAM at 80 MHz but use the safer
# 40 MHz SPI flash boot clock.
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
